app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$wFx/YMiu/hbT3wvGM7rj5.OEEb.SgsMW6aUhWgV15OTJLRmdh64ea"], ["updated_at", "2017-09-20 07:32:01.027659"], ["id", 950961012]]
---
  def update
    if @user.update_attributes(user_params)